<?php

echo 'Задача №1 <br>';

$a = 1;
while($a <= 100){
    if ($a % 3 == 0){
    echo "$a<br/>";
    }
    $a++;
}
echo '<br>';

echo 'Задача №2 <br>';

$a = 0;
do{
    if($a == 0){
        echo "$a - ноль<br/>";
    }elseif($a % 2 == 0){
        echo "$a - четное число<br/>";
    }else{
        echo "$a - нечетное число<br/>";
    }
    $a++;
} while($a <= 10);

echo '<br>';

echo 'Задача №3 <br>';
$cities = array(
    'Москвовская область' => array('Москва', 'Зеленоград', 'Клин'),
    'Ленинградская область' => array('Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'),
    'Рязанская область' => array('Рязань', 'Шацк', 'Михайлов'),
    'Липецская область' => array('Липецк', 'Елец', 'Лебедянь')
);
foreach($cities as $key => $value){
    echo '<pre>';
    echo "<h3>$key: </h3>";
    echo '</pre>';
    foreach($value as $item){
        echo '<pre>';
        echo "$item";
        echo '</pre>';
    }
}

echo '<br>';

echo 'Задача №4 <br>';

// function transliteration($string){
//     $letters = [
//         'а' => 'a','б' => 'b','в' => 'v','г' => 'g',
//         'д' => 'd','е' => 'e','ё' => 'yo','ж' => 'zh',
//         'з' => 'z','и' => 'i','й' => 'j','к' => 'k',
//         'л' => 'l','м' => 'm','н' => 'n','о' => 'o',
//         'п' => 'p','р' => 'r','с' => 's','т' => 't',
//         'у' => 'u','ф' => 'f','х' => 'kh','ц' => 'ts',
//         'ч' => 'ch','ш' => 'sh','щ' => 'shch','ъ' => '`',
//         'ы' => 'y','ь' => '`','э' => 'e','ю' => 'yu','я' => 'ya',
//         'А' => 'A', 'Б' => 'B', 'В' => 'V', 'Г' => 'G',
//         'Д' => 'D', 'Е' => 'E', 'Ё' => 'Yo', 'Ж' => 'Zh',
//         'З' => 'Z', 'И' => 'I', 'Й' => 'J', 'К' => 'K',
//         'Л' => 'L', 'М' => 'M', 'Н' => 'N', 'О' => 'O',
//         'П' => 'P', 'Р' => 'R', 'С' => 'S', 'Т' => 'T',
//         'У' => 'U', 'Ф' => 'F', 'Х' => 'Kh', 'Ц' => 'Ts',
//         'Ч' => 'Ch', 'Ш' => 'Sh', 'Щ' => 'Shch', 'Ъ' => '`',
//         'Ы' => 'Y', 'Ь' => '`', 'Э' => 'E', 'Ю' => 'Yu', 'Я' => 'Ya'
//     ];
    
//     return strtr($string, $letters);
// }

// echo transliteration('Гарри Поттер и Принц-полукровка');


function transliteration($text){
        $letters = [
        'а' => 'a','б' => 'b','в' => 'v','г' => 'g',
        'д' => 'd','е' => 'e','ё' => 'yo','ж' => 'zh',
        'з' => 'z','и' => 'i','й' => 'j','к' => 'k',
        'л' => 'l','м' => 'm','н' => 'n','о' => 'o',
        'п' => 'p','р' => 'r','с' => 's','т' => 't',
        'у' => 'u','ф' => 'f','х' => 'kh','ц' => 'ts',
        'ч' => 'ch','ш' => 'sh','щ' => 'shch','ъ' => '`',
        'ы' => 'y','ь' => '`','э' => 'e','ю' => 'yu','я' => 'ya',
        'А' => 'A', 'Б' => 'B', 'В' => 'V', 'Г' => 'G',
        'Д' => 'D', 'Е' => 'E', 'Ё' => 'Yo', 'Ж' => 'Zh',
        'З' => 'Z', 'И' => 'I', 'Й' => 'J', 'К' => 'K',
        'Л' => 'L', 'М' => 'M', 'Н' => 'N', 'О' => 'O',
        'П' => 'P', 'Р' => 'R', 'С' => 'S', 'Т' => 'T',
        'У' => 'U', 'Ф' => 'F', 'Х' => 'Kh', 'Ц' => 'Ts',
        'Ч' => 'Ch', 'Ш' => 'Sh', 'Щ' => 'Shch', 'Ъ' => '`',
        'Ы' => 'Y', 'Ь' => '`', 'Э' => 'E', 'Ю' => 'Yu', 'Я' => 'Ya'
        ];
        $textArr = preg_split('//u', $text, -1, PREG_SPLIT_NO_EMPTY);
        $translitText = '';

        foreach($textArr as $value){
            $translitText .= (isset($letters[$value])) ? $letters[$value] : $value;
 
        }
        return $translitText;
}

$text = 'Новый чудный мир!';
echo transliteration($text);


echo '<br>';
echo '<br>';

echo 'Задача №5 <br>';

function replace($text){
    $reText = str_replace(' ', '_', $text);
    return $reText;
}
echo replace("Гарри Поттер и Философский камень");

// Задача №6
// Задача находится в отдельной папке


echo '<br>';
echo '<br>';

echo 'Задача №7 <br>';
for($i = 0; $i <= 9; print $i . '<br>', $i++){};


echo '<br>';

echo 'Задача №8 <br>';
$cities = array(
    'Москвовская область' => array('Москва', 'Зеленоград', 'Клин'),
    'Ленинградская область' => array('Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'),
    'Рязанская область' => array('Рязань', 'Шацк', 'Михайлов'),
    'Липецская область' => array('Липецк', 'Елец', 'Лебедянь')
);
foreach($cities as $key => $value){
    echo '<pre>' . "<h3>$key: </h3>" . '</pre>';
    foreach($value as $item){
        if(mb_substr($item, 0, 1) == "К")
        echo '<pre>' . "$item" . '</pre>';
    }
};

echo '<br>';
echo '<br>';

echo 'Задача №9 <br>';

function transliterations($text){
    $letters = [
    'а' => 'a','б' => 'b','в' => 'v','г' => 'g',
    'д' => 'd','е' => 'e','ё' => 'yo','ж' => 'zh',
    'з' => 'z','и' => 'i','й' => 'j','к' => 'k',
    'л' => 'l','м' => 'm','н' => 'n','о' => 'o',
    'п' => 'p','р' => 'r','с' => 's','т' => 't',
    'у' => 'u','ф' => 'f','х' => 'kh','ц' => 'ts',
    'ч' => 'ch','ш' => 'sh','щ' => 'shch','ъ' => '`',
    'ы' => 'y','ь' => '`','э' => 'e','ю' => 'yu','я' => 'ya',
    'А' => 'A', 'Б' => 'B', 'В' => 'V', 'Г' => 'G',
    'Д' => 'D', 'Е' => 'E', 'Ё' => 'Yo', 'Ж' => 'Zh',
    'З' => 'Z', 'И' => 'I', 'Й' => 'J', 'К' => 'K',
    'Л' => 'L', 'М' => 'M', 'Н' => 'N', 'О' => 'O',
    'П' => 'P', 'Р' => 'R', 'С' => 'S', 'Т' => 'T',
    'У' => 'U', 'Ф' => 'F', 'Х' => 'Kh', 'Ц' => 'Ts',
    'Ч' => 'Ch', 'Ш' => 'Sh', 'Щ' => 'Shch', 'Ъ' => '`',
    'Ы' => 'Y', 'Ь' => '`', 'Э' => 'E', 'Ю' => 'Yu', 'Я' => 'Ya', ' ' => '_'
    ];
    // $textArr = preg_split('//u', $text, -1, PREG_SPLIT_NO_EMPTY);
    // $translitText = '';
    // foreach($textArr as $value){
    //     $translitText .= (isset($letters[$value])) ? $letters[$value] : $value;
    // }
    // return $translitText;

    return strtr($text, $letters);

};
$text = 'Базовый курс PHP';
echo transliterations($text);

?>