<?php

// Задача №1

// $a = 1;
// while($a <= 100){
//     if ($a % 3 == 0){
//     echo "$a<br/>";
//     }
//     $a++;
// }


// Задача №2
// $a = 0;
// do{
//     if($a == 0){
//         echo "$a - ноль<br/>";
//     }elseif($a % 2 == 0){
//         echo "$a - четное число<br/>";
//     }else{
//         echo "$a - нечетное число<br/>";
//     }
//     $a++;
// } while($a <= 10);

// Задача №3
// $cities = array(
//     'Москвовская область' => array('Москва', 'Зеленоград', 'Клин'),
//     'Ленинградская область' => array('Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'),
//     'Рязанская область' => array('Рязань', 'Шацк', 'Михайлов'),
//     'Липецская область' => array('Липецк', 'Елец', 'Лебедянь')
// );
// foreach($cities as $key => $value){
//     echo '<pre>';
//     echo "<h3>$key : </h3>";
//     echo '</pre>';
//     foreach($value as $item){
//         echo '<pre>';
//         echo "$item";
//         echo '</pre>';

//     }
// }


// Задача №4
$letters = [
    'а' => 'a',
    'б' => 'b',
    'в' => 'v',
    'г' => 'g',
    'д' => 'd',
    'е' => 'e',
    'ё' => 'yo',
    'ж' => 'zh',
    'з' => 'z',
    'и' => 'i',
    'й' => 'j',
    'к' => 'k',
    'л' => 'l',
    'м' => 'm',
    'н' => 'n',
    'о' => 'o',
    'п' => 'p',
    'р' => 'r',
    'с' => 's',
    'т' => 't',
    'у' => 'u',
    'ф' => 'f',
    'х' => 'kh',
    'ц' => 'ts',
    'ч' => 'ch',
    'ш' => 'sh',
    'щ' => 'shch',
    'ъ' => '`',
    'ы' => 'y',
    'ь' => '`',
    'э' => 'e',
    'ю' => 'yu',
    'я' => 'ya'
];
// перебрать строку и сравнить ее с массивом $letters, если находяться совпадения то заменить значение
// echo '<pre>';
// print_r($letters);
// echo '</pre>';


// Задача №5
//перебрать строку и если там будут пробелы, заменить их на подчеркивания "_". вернуть новую строку



// Задача №6
//создать их меню сайта меню ввиде массива и вставить его в html. попробовать сделать подменю



// Задача №7
//вывести с помощью цикла for числа от 0 до 9 без тело цикла
for($i = 0; print  $i; $i++ < 9);



// Задача №8
// $cities = array(
//     'Москвовская область' => array('Москва', 'Зеленоград', 'Клин'),
//     'Ленинградская область' => array('Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'),
//     'Рязанская область' => array('Рязань', 'Шацк', 'Михайлов'),
//     'Липецская область' => array('Липецк', 'Елец', 'Лебедянь')
// );
// if()


// foreach($cities as $key => $value){
//     echo '<pre>';
//     echo "<h3>$key : </h3>";
//     echo '</pre>';
//     foreach($value as $item){
//         echo '<pre>';
//         echo "$item";
//         echo '</pre>';

//     }
// }



// Задача №9
// совместить функции по работе со строками, где выдется транслитерированная строка на анг 
//с подчеркиваниями

?>